Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025das169.h
extern volatile __DCH6ECONbits_t DCH6ECONbits __asm__ ("DCH6ECON") __attribute__((section("sfrs"), address(0xBF8114F0)));
extern volatile uint32_t        DCH6ECONCLR __attribute__((section("sfrs"),address(0xBF8114F4)));
extern volatile uint32_t        DCH6ECONSET __attribute__((section("sfrs"),address(0xBF8114F8)));
extern volatile uint32_t        DCH6ECONINV __attribute__((section("sfrs"),address(0xBF8114FC)));
#define DCH6INT DCH6INT
extern volatile uint32_t   DCH6INT __attribute__((section("sfrs"), address(0xBF811500)));
typedef struct {
  uint32_t CHERIF:1;
  uint32_t CHTAIF:1;
  uint32_t CHCCIF:1;
  uint32_t CHBCIF:1;
  uint32_t CHDHIF:1;
  uint32_t CHDDIF:1;
  uint32_t CHSHIF:1;
  uint32_t CHSDIF:1;
  uint32_t :8;
  uint32_t CHERIE:1;
  uint32_t CHTAIE:1;
  uint32_t CHCCIE:1;
  uint32_t CHBCIE:1;
  uint32_t CHDHIE:1;
  uint32_t CHDDIE:1;
  uint32_t CHSHIE:1;
  uint32_t CHSDIE:1;
} __DCH6INTbits_t;
extern volatile __DCH6INTbits_t DCH6INTbits __asm__ ("DCH6INT") __attribute__((section("sfrs"), address(0xBF811500)));
extern volatile uint32_t        DCH6INTCLR __attribute__((section("sfrs"),address(0xBF811504)));
extern volatile uint32_t        DCH6INTSET __attribute__((section("sfrs"),address(0xBF811508)));
extern volatile uint32_t        DCH6INTINV __attribute__((section("sfrs"),address(0xBF81150C)));
#define DCH6SSA DCH6SSA
extern volatile uint32_t   DCH6SSA __attribute__((section("sfrs"), address(0xBF811510)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH6SSAbits_t;
extern volatile __DCH6SSAbits_t DCH6SSAbits __asm__ ("DCH6SSA") __attribute__((section("sfrs"), address(0xBF811510)));
extern volatile uint32_t        DCH6SSACLR __attribute__((section("sfrs"),address(0xBF811514)));
extern volatile uint32_t        DCH6SSASET __attribute__((section("sfrs"),address(0xBF811518)));
extern volatile uint32_t        DCH6SSAINV __attribute__((section("sfrs"),address(0xBF81151C)));
#define DCH6DSA DCH6DSA
extern volatile uint32_t   DCH6DSA __attribute__((section("sfrs"), address(0xBF811520)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH6DSAbits_t;
extern volatile __DCH6DSAbits_t DCH6DSAbits __asm__ ("DCH6DSA") __attribute__((section("sfrs"), address(0xBF811520)));
extern volatile uint32_t        DCH6DSACLR __attribute__((section("sfrs"),address(0xBF811524)));
extern volatile uint32_t        DCH6DSASET __attribute__((section("sfrs"),address(0xBF811528)));
extern volatile uint32_t        DCH6DSAINV __attribute__((section("sfrs"),address(0xBF81152C)));
#define DCH6SSIZ DCH6SSIZ
extern volatile uint32_t   DCH6SSIZ __attribute__((section("sfrs"), address(0xBF811530)));
typedef struct {
  uint32_t CHSSIZ:16;
} __DCH6SSIZbits_t;
extern volatile __DCH6SSIZbits_t DCH6SSIZbits __asm__ ("DCH6SSIZ") __attribute__((section("sfrs"), address(0xBF811530)));
extern volatile uint32_t        DCH6SSIZCLR __attribute__((section("sfrs"),address(0xBF811534)));
extern volatile uint32_t        DCH6SSIZSET __attribute__((section("sfrs"),address(0xBF811538)));
extern volatile uint32_t        DCH6SSIZINV __attribute__((section("sfrs"),address(0xBF81153C)));
#define DCH6DSIZ DCH6DSIZ
extern volatile uint32_t   DCH6DSIZ __attribute__((section("sfrs"), address(0xBF811540)));
typedef struct {
  uint32_t CHDSIZ:16;
} __DCH6DSIZbits_t;
extern volatile __DCH6DSIZbits_t DCH6DSIZbits __asm__ ("DCH6DSIZ") __attribute__((section("sfrs"), address(0xBF811540)));
extern volatile uint32_t        DCH6DSIZCLR __attribute__((section("sfrs"),address(0xBF811544)));
extern volatile uint32_t        DCH6DSIZSET __attribute__((section("sfrs"),address(0xBF811548)));
extern volatile uint32_t        DCH6DSIZINV __attribute__((section("sfrs"),address(0xBF81154C)));
#define DCH6SPTR DCH6SPTR
extern volatile uint32_t   DCH6SPTR __attribute__((section("sfrs"), address(0xBF811550)));
typedef struct {
  uint32_t CHSPTR:16;
} __DCH6SPTRbits_t;
extern volatile __DCH6SPTRbits_t DCH6SPTRbits __asm__ ("DCH6SPTR") __attribute__((section("sfrs"), address(0xBF811550)));
extern volatile uint32_t        DCH6SPTRCLR __attribute__((section("sfrs"),address(0xBF811554)));
extern volatile uint32_t        DCH6SPTRSET __attribute__((section("sfrs"),address(0xBF811558)));
extern volatile uint32_t        DCH6SPTRINV __attribute__((section("sfrs"),address(0xBF81155C)));
#define DCH6DPTR DCH6DPTR
extern volatile uint32_t   DCH6DPTR __attribute__((section("sfrs"), address(0xBF811560)));
typedef struct {
  uint32_t CHDPTR:16;
} __DCH6DPTRbits_t;
extern volatile __DCH6DPTRbits_t DCH6DPTRbits __asm__ ("DCH6DPTR") __attribute__((section("sfrs"), address(0xBF811560)));
extern volatile uint32_t        DCH6DPTRCLR __attribute__((section("sfrs"),address(0xBF811564)));
extern volatile uint32_t        DCH6DPTRSET __attribute__((section("sfrs"),address(0xBF811568)));
extern volatile uint32_t        DCH6DPTRINV __attribute__((section("sfrs"),address(0xBF81156C)));
#define DCH6CSIZ DCH6CSIZ
extern volatile uint32_t   DCH6CSIZ __attribute__((section("sfrs"), address(0xBF811570)));
typedef struct {
  uint32_t CHCSIZ:16;
} __DCH6CSIZbits_t;
extern volatile __DCH6CSIZbits_t DCH6CSIZbits __asm__ ("DCH6CSIZ") __attribute__((section("sfrs"), address(0xBF811570)));
extern volatile uint32_t        DCH6CSIZCLR __attribute__((section("sfrs"),address(0xBF811574)));
extern volatile uint32_t        DCH6CSIZSET __attribute__((section("sfrs"),address(0xBF811578)));
extern volatile uint32_t        DCH6CSIZINV __attribute__((section("sfrs"),address(0xBF81157C)));
#define DCH6CPTR DCH6CPTR
extern volatile uint32_t   DCH6CPTR __attribute__((section("sfrs"), address(0xBF811580)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH6CPTRbits_t;
extern volatile __DCH6CPTRbits_t DCH6CPTRbits __asm__ ("DCH6CPTR") __attribute__((section("sfrs"), address(0xBF811580)));
#define DCS6CPTR DCS6CPTR
extern volatile uint32_t   DCS6CPTR __attribute__((section("sfrs"), address(0xBF811580)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS6CPTRbits_t;
extern volatile __DCS6CPTRbits_t DCS6CPTRbits __asm__ ("DCS6CPTR") __attribute__((section("sfrs"), address(0xBF811580)));
extern volatile uint32_t        DCH6CPTRCLR __attribute__((section("sfrs"),address(0xBF811584)));
extern volatile uint32_t        DCS6CPTRCLR __attribute__((section("sfrs"),address(0xBF811584)));
extern volatile uint32_t        DCH6CPTRSET __attribute__((section("sfrs"),address(0xBF811588)));
extern volatile uint32_t        DCS6CPTRSET __attribute__((section("sfrs"),address(0xBF811588)));
extern volatile uint32_t        DCH6CPTRINV __attribute__((section("sfrs"),address(0xBF81158C)));
extern volatile uint32_t        DCS6CPTRINV __attribute__((section("sfrs"),address(0xBF81158C)));
#define DCH6DAT DCH6DAT
extern volatile uint32_t   DCH6DAT __attribute__((section("sfrs"), address(0xBF811590)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH6DATbits_t;
extern volatile __DCH6DATbits_t DCH6DATbits __asm__ ("DCH6DAT") __attribute__((section("sfrs"), address(0xBF811590)));
extern volatile uint32_t        DCH6DATCLR __attribute__((section("sfrs"),address(0xBF811594)));
extern volatile uint32_t        DCH6DATSET __attribute__((section("sfrs"),address(0xBF811598)));
extern volatile uint32_t        DCH6DATINV __attribute__((section("sfrs"),address(0xBF81159C)));
#define DCH7CON DCH7CON
extern volatile uint32_t   DCH7CON __attribute__((section("sfrs"), address(0xBF8115A0)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH7CONbits_t;
extern volatile __DCH7CONbits_t DCH7CONbits __asm__ ("DCH7CON") __attribute__((section("sfrs"), address(0xBF8115A0)));
extern volatile uint32_t        DCH7CONCLR __attribute__((section("sfrs"),address(0xBF8115A4)));
extern volatile uint32_t        DCH7CONSET __attribute__((section("sfrs"),address(0xBF8115A8)));
extern volatile uint32_t        DCH7CONINV __attribute__((section("sfrs"),address(0xBF8115AC)));
#define DCH7ECON DCH7ECON
extern volatile uint32_t   DCH7ECON __attribute__((section("sfrs"), address(0xBF8115B0)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH7ECONbits_t;
extern volatile __DCH7ECONbits_t DCH7ECONbits __asm__ ("DCH7ECON") __attribute__((section("sfrs"), address(0xBF8115B0)));
extern volatile uint32_t        DCH7ECONCLR __attribute__((section("sfrs"),address(0xBF8115B4)));
extern volatile uint32_t        DCH7ECONSET __attribute__((section("sfrs"),address(0xBF8115B8)));
extern volatile uint32_t        DCH7ECONINV __attribute__((section("sfrs"),address(0xBF8115BC)));
#define DCH7INT DCH7INT
extern volatile uint32_t   DCH7INT __attribute__((section("sfrs"), address(0xBF8115C0)));
typedef struct {
  uint32_t CHERIF:1;
  uint32_t CHTAIF:1;
  uint32_t CHCCIF:1;
  uint32_t CHBCIF:1;
  uint32_t CHDHIF:1;
  uint32_t CHDDIF:1;
  uint32_t CHSHIF:1;
  uint32_t CHSDIF:1;
  uint32_t :8;
  uint32_t CHERIE:1;
  uint32_t CHTAIE:1;
  uint32_t CHCCIE:1;
  uint32_t CHBCIE:1;
  uint32_t CHDHIE:1;
  uint32_t CHDDIE:1;
  uint32_t CHSHIE:1;
  uint32_t CHSDIE:1;
} __DCH7INTbits_t;
extern volatile __DCH7INTbits_t DCH7INTbits __asm__ ("DCH7INT") __attribute__((section("sfrs"), address(0xBF8115C0)));
extern volatile uint32_t        DCH7INTCLR __attribute__((section("sfrs"),address(0xBF8115C4)));
extern volatile uint32_t        DCH7INTSET __attribute__((section("sfrs"),address(0xBF8115C8)));
extern volatile uint32_t        DCH7INTINV __attribute__((section("sfrs"),address(0xBF8115CC)));
#define DCH7SSA DCH7SSA
extern volatile uint32_t   DCH7SSA __attribute__((section("sfrs"), address(0xBF8115D0)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH7SSAbits_t;
extern volatile __DCH7SSAbits_t DCH7SSAbits __asm__ ("DCH7SSA") __attribute__((section("sfrs"), address(0xBF8115D0)));
extern volatile uint32_t        DCH7SSACLR __attribute__((section("sfrs"),address(0xBF8115D4)));
extern volatile uint32_t        DCH7SSASET __attribute__((section("sfrs"),address(0xBF8115D8)));
extern volatile uint32_t        DCH7SSAINV __attribute__((section("sfrs"),address(0xBF8115DC)));
#define DCH7DSA DCH7DSA
extern volatile uint32_t   DCH7DSA __attribute__((section("sfrs"), address(0xBF8115E0)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH7DSAbits_t;
extern volatile __DCH7DSAbits_t DCH7DSAbits __asm__ ("DCH7DSA") __attribute__((section("sfrs"), address(0xBF8115E0)));
extern volatile uint32_t        DCH7DSACLR __attribute__((section("sfrs"),address(0xBF8115E4)));
extern volatile uint32_t        DCH7DSASET __attribute__((section("sfrs"),address(0xBF8115E8)));
extern volatile uint32_t        DCH7DSAINV __attribute__((section("sfrs"),address(0xBF8115EC)));
#define DCH7SSIZ DCH7SSIZ
extern volatile uint32_t   DCH7SSIZ __attribute__((section("sfrs"), address(0xBF8115F0)));
typedef struct {
  uint32_t CHSSIZ:16;
} __DCH7SSIZbits_t;
extern volatile __DCH7SSIZbits_t DCH7SSIZbits __asm__ ("DCH7SSIZ") __attribute__((section("sfrs"), address(0xBF8115F0)));
extern volatile uint32_t        DCH7SSIZCLR __attribute__((section("sfrs"),address(0xBF8115F4)));
extern volatile uint32_t        DCH7SSIZSET __attribute__((section("sfrs"),address(0xBF8115F8)));
extern volatile uint32_t        DCH7SSIZINV __attribute__((section("sfrs"),address(0xBF8115FC)));
#define DCH7DSIZ DCH7DSIZ
extern volatile uint32_t   DCH7DSIZ __attribute__((section("sfrs"), address(0xBF811600)));
typedef struct {
  uint32_t CHDSIZ:16;
} __DCH7DSIZbits_t;
extern volatile __DCH7DSIZbits_t DCH7DSIZbits __asm__ ("DCH7DSIZ") __attribute__((section("sfrs"), address(0xBF811600)));
extern volatile uint32_t        DCH7DSIZCLR __attribute__((section("sfrs"),address(0xBF811604)));
extern volatile uint32_t        DCH7DSIZSET __attribute__((section("sfrs"),address(0xBF811608)));
extern volatile uint32_t        DCH7DSIZINV __attribute__((section("sfrs"),address(0xBF81160C)));
#define DCH7SPTR DCH7SPTR
extern volatile uint32_t   DCH7SPTR __attribute__((section("sfrs"), address(0xBF811610)));
typedef struct {
  uint32_t CHSPTR:16;
} __DCH7SPTRbits_t;
extern volatile __DCH7SPTRbits_t DCH7SPTRbits __asm__ ("DCH7SPTR") __attribute__((section("sfrs"), address(0xBF811610)));
extern volatile uint32_t        DCH7SPTRCLR __attribute__((section("sfrs"),address(0xBF811614)));
extern volatile uint32_t        DCH7SPTRSET __attribute__((section("sfrs"),address(0xBF811618)));
extern volatile uint32_t        DCH7SPTRINV __attribute__((section("sfrs"),address(0xBF81161C)));
#define DCH7DPTR DCH7DPTR
extern volatile uint32_t   DCH7DPTR __attribute__((section("sfrs"), address(0xBF811620)));
typedef struct {
  uint32_t CHDPTR:16;
} __DCH7DPTRbits_t;
extern volatile __DCH7DPTRbits_t DCH7DPTRbits __asm__ ("DCH7DPTR") __attribute__((section("sfrs"), address(0xBF811620)));
extern volatile uint32_t        DCH7DPTRCLR __attribute__((section("sfrs"),address(0xBF811624)));
extern volatile uint32_t        DCH7DPTRSET __attribute__((section("sfrs"),address(0xBF811628)));
extern volatile uint32_t        DCH7DPTRINV __attribute__((section("sfrs"),address(0xBF81162C)));
#define DCH7CSIZ DCH7CSIZ
extern volatile uint32_t   DCH7CSIZ __attribute__((section("sfrs"), address(0xBF811630)));
typedef struct {
  uint32_t CHCSIZ:16;
} __DCH7CSIZbits_t;
