Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025das169.h
#define _GLCDCLUT255_BLUE_POSITION               0x00000000
#define _GLCDCLUT255_BLUE_MASK                   0x000000FF
#define _GLCDCLUT255_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT255_GREEN_POSITION              0x00000008
#define _GLCDCLUT255_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT255_GREEN_LENGTH                0x00000008

#define _GLCDCLUT255_RED_POSITION                0x00000010
#define _GLCDCLUT255_RED_MASK                    0x00FF0000
#define _GLCDCLUT255_RED_LENGTH                  0x00000008

#define _GLCDCURDATA0_PIXEL07_POSITION           0x00000000
#define _GLCDCURDATA0_PIXEL07_MASK               0x0000000F
#define _GLCDCURDATA0_PIXEL07_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL06_POSITION           0x00000004
#define _GLCDCURDATA0_PIXEL06_MASK               0x000000F0
#define _GLCDCURDATA0_PIXEL06_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL05_POSITION           0x00000008
#define _GLCDCURDATA0_PIXEL05_MASK               0x00000F00
#define _GLCDCURDATA0_PIXEL05_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL04_POSITION           0x0000000C
#define _GLCDCURDATA0_PIXEL04_MASK               0x0000F000
#define _GLCDCURDATA0_PIXEL04_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL03_POSITION           0x00000010
#define _GLCDCURDATA0_PIXEL03_MASK               0x000F0000
#define _GLCDCURDATA0_PIXEL03_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL02_POSITION           0x00000014
#define _GLCDCURDATA0_PIXEL02_MASK               0x00F00000
#define _GLCDCURDATA0_PIXEL02_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL01_POSITION           0x00000018
#define _GLCDCURDATA0_PIXEL01_MASK               0x0F000000
#define _GLCDCURDATA0_PIXEL01_LENGTH             0x00000004

#define _GLCDCURDATA0_PIXEL00_POSITION           0x0000001C
#define _GLCDCURDATA0_PIXEL00_MASK               0xF0000000
#define _GLCDCURDATA0_PIXEL00_LENGTH             0x00000004

#define _GLCDCURDATA1_PIXEL015_POSITION          0x00000000
#define _GLCDCURDATA1_PIXEL015_MASK              0x0000000F
#define _GLCDCURDATA1_PIXEL015_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL014_POSITION          0x00000004
#define _GLCDCURDATA1_PIXEL014_MASK              0x000000F0
#define _GLCDCURDATA1_PIXEL014_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL013_POSITION          0x00000008
#define _GLCDCURDATA1_PIXEL013_MASK              0x00000F00
#define _GLCDCURDATA1_PIXEL013_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL012_POSITION          0x0000000C
#define _GLCDCURDATA1_PIXEL012_MASK              0x0000F000
#define _GLCDCURDATA1_PIXEL012_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL011_POSITION          0x00000010
#define _GLCDCURDATA1_PIXEL011_MASK              0x000F0000
#define _GLCDCURDATA1_PIXEL011_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL010_POSITION          0x00000014
#define _GLCDCURDATA1_PIXEL010_MASK              0x00F00000
#define _GLCDCURDATA1_PIXEL010_LENGTH            0x00000004

#define _GLCDCURDATA1_PIXEL09_POSITION           0x00000018
#define _GLCDCURDATA1_PIXEL09_MASK               0x0F000000
#define _GLCDCURDATA1_PIXEL09_LENGTH             0x00000004

#define _GLCDCURDATA1_PIXEL08_POSITION           0x0000001C
#define _GLCDCURDATA1_PIXEL08_MASK               0xF0000000
#define _GLCDCURDATA1_PIXEL08_LENGTH             0x00000004

#define _GLCDCURDATA2_PIXEL023_POSITION          0x00000000
#define _GLCDCURDATA2_PIXEL023_MASK              0x0000000F
#define _GLCDCURDATA2_PIXEL023_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL022_POSITION          0x00000004
#define _GLCDCURDATA2_PIXEL022_MASK              0x000000F0
#define _GLCDCURDATA2_PIXEL022_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL021_POSITION          0x00000008
#define _GLCDCURDATA2_PIXEL021_MASK              0x00000F00
#define _GLCDCURDATA2_PIXEL021_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL020_POSITION          0x0000000C
#define _GLCDCURDATA2_PIXEL020_MASK              0x0000F000
#define _GLCDCURDATA2_PIXEL020_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL019_POSITION          0x00000010
#define _GLCDCURDATA2_PIXEL019_MASK              0x000F0000
#define _GLCDCURDATA2_PIXEL019_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL018_POSITION          0x00000014
#define _GLCDCURDATA2_PIXEL018_MASK              0x00F00000
#define _GLCDCURDATA2_PIXEL018_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL017_POSITION          0x00000018
#define _GLCDCURDATA2_PIXEL017_MASK              0x0F000000
#define _GLCDCURDATA2_PIXEL017_LENGTH            0x00000004

#define _GLCDCURDATA2_PIXEL016_POSITION          0x0000001C
#define _GLCDCURDATA2_PIXEL016_MASK              0xF0000000
#define _GLCDCURDATA2_PIXEL016_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL031_POSITION          0x00000000
#define _GLCDCURDATA3_PIXEL031_MASK              0x0000000F
#define _GLCDCURDATA3_PIXEL031_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL030_POSITION          0x00000004
#define _GLCDCURDATA3_PIXEL030_MASK              0x000000F0
#define _GLCDCURDATA3_PIXEL030_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL029_POSITION          0x00000008
#define _GLCDCURDATA3_PIXEL029_MASK              0x00000F00
#define _GLCDCURDATA3_PIXEL029_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL028_POSITION          0x0000000C
#define _GLCDCURDATA3_PIXEL028_MASK              0x0000F000
#define _GLCDCURDATA3_PIXEL028_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL027_POSITION          0x00000010
#define _GLCDCURDATA3_PIXEL027_MASK              0x000F0000
#define _GLCDCURDATA3_PIXEL027_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL026_POSITION          0x00000014
#define _GLCDCURDATA3_PIXEL026_MASK              0x00F00000
#define _GLCDCURDATA3_PIXEL026_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL025_POSITION          0x00000018
#define _GLCDCURDATA3_PIXEL025_MASK              0x0F000000
#define _GLCDCURDATA3_PIXEL025_LENGTH            0x00000004

#define _GLCDCURDATA3_PIXEL024_POSITION          0x0000001C
#define _GLCDCURDATA3_PIXEL024_MASK              0xF0000000
#define _GLCDCURDATA3_PIXEL024_LENGTH            0x00000004

