Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2025das169.h
#define _GLCDCURDATA88_PIXEL225_POSITION         0x00000008
#define _GLCDCURDATA88_PIXEL225_MASK             0x00000F00
#define _GLCDCURDATA88_PIXEL225_LENGTH           0x00000004

#define _GLCDCURDATA88_PIXEL224_POSITION         0x0000000C
#define _GLCDCURDATA88_PIXEL224_MASK             0x0000F000
#define _GLCDCURDATA88_PIXEL224_LENGTH           0x00000004

#define _GLCDCURDATA88_PIXEL223_POSITION         0x00000010
#define _GLCDCURDATA88_PIXEL223_MASK             0x000F0000
#define _GLCDCURDATA88_PIXEL223_LENGTH           0x00000004

#define _GLCDCURDATA88_PIXEL222_POSITION         0x00000014
#define _GLCDCURDATA88_PIXEL222_MASK             0x00F00000
#define _GLCDCURDATA88_PIXEL222_LENGTH           0x00000004

#define _GLCDCURDATA88_PIXEL221_POSITION         0x00000018
#define _GLCDCURDATA88_PIXEL221_MASK             0x0F000000
#define _GLCDCURDATA88_PIXEL221_LENGTH           0x00000004

#define _GLCDCURDATA88_PIXEL220_POSITION         0x0000001C
#define _GLCDCURDATA88_PIXEL220_MASK             0xF0000000
#define _GLCDCURDATA88_PIXEL220_LENGTH           0x00000004

#define _GLCDCURDATA89_PIXEL2215_POSITION        0x00000000
#define _GLCDCURDATA89_PIXEL2215_MASK            0x0000000F
#define _GLCDCURDATA89_PIXEL2215_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL2214_POSITION        0x00000004
#define _GLCDCURDATA89_PIXEL2214_MASK            0x000000F0
#define _GLCDCURDATA89_PIXEL2214_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL2213_POSITION        0x00000008
#define _GLCDCURDATA89_PIXEL2213_MASK            0x00000F00
#define _GLCDCURDATA89_PIXEL2213_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL2212_POSITION        0x0000000C
#define _GLCDCURDATA89_PIXEL2212_MASK            0x0000F000
#define _GLCDCURDATA89_PIXEL2212_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL2211_POSITION        0x00000010
#define _GLCDCURDATA89_PIXEL2211_MASK            0x000F0000
#define _GLCDCURDATA89_PIXEL2211_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL2210_POSITION        0x00000014
#define _GLCDCURDATA89_PIXEL2210_MASK            0x00F00000
#define _GLCDCURDATA89_PIXEL2210_LENGTH          0x00000004

#define _GLCDCURDATA89_PIXEL229_POSITION         0x00000018
#define _GLCDCURDATA89_PIXEL229_MASK             0x0F000000
#define _GLCDCURDATA89_PIXEL229_LENGTH           0x00000004

#define _GLCDCURDATA89_PIXEL228_POSITION         0x0000001C
#define _GLCDCURDATA89_PIXEL228_MASK             0xF0000000
#define _GLCDCURDATA89_PIXEL228_LENGTH           0x00000004

#define _GLCDCURDATA90_PIXEL2223_POSITION        0x00000000
#define _GLCDCURDATA90_PIXEL2223_MASK            0x0000000F
#define _GLCDCURDATA90_PIXEL2223_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2222_POSITION        0x00000004
#define _GLCDCURDATA90_PIXEL2222_MASK            0x000000F0
#define _GLCDCURDATA90_PIXEL2222_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2221_POSITION        0x00000008
#define _GLCDCURDATA90_PIXEL2221_MASK            0x00000F00
#define _GLCDCURDATA90_PIXEL2221_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2220_POSITION        0x0000000C
#define _GLCDCURDATA90_PIXEL2220_MASK            0x0000F000
#define _GLCDCURDATA90_PIXEL2220_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2219_POSITION        0x00000010
#define _GLCDCURDATA90_PIXEL2219_MASK            0x000F0000
#define _GLCDCURDATA90_PIXEL2219_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2218_POSITION        0x00000014
#define _GLCDCURDATA90_PIXEL2218_MASK            0x00F00000
#define _GLCDCURDATA90_PIXEL2218_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2217_POSITION        0x00000018
#define _GLCDCURDATA90_PIXEL2217_MASK            0x0F000000
#define _GLCDCURDATA90_PIXEL2217_LENGTH          0x00000004

#define _GLCDCURDATA90_PIXEL2216_POSITION        0x0000001C
#define _GLCDCURDATA90_PIXEL2216_MASK            0xF0000000
#define _GLCDCURDATA90_PIXEL2216_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2231_POSITION        0x00000000
#define _GLCDCURDATA91_PIXEL2231_MASK            0x0000000F
#define _GLCDCURDATA91_PIXEL2231_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2230_POSITION        0x00000004
#define _GLCDCURDATA91_PIXEL2230_MASK            0x000000F0
#define _GLCDCURDATA91_PIXEL2230_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2229_POSITION        0x00000008
#define _GLCDCURDATA91_PIXEL2229_MASK            0x00000F00
#define _GLCDCURDATA91_PIXEL2229_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2228_POSITION        0x0000000C
#define _GLCDCURDATA91_PIXEL2228_MASK            0x0000F000
#define _GLCDCURDATA91_PIXEL2228_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2227_POSITION        0x00000010
#define _GLCDCURDATA91_PIXEL2227_MASK            0x000F0000
#define _GLCDCURDATA91_PIXEL2227_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2226_POSITION        0x00000014
#define _GLCDCURDATA91_PIXEL2226_MASK            0x00F00000
#define _GLCDCURDATA91_PIXEL2226_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2225_POSITION        0x00000018
#define _GLCDCURDATA91_PIXEL2225_MASK            0x0F000000
#define _GLCDCURDATA91_PIXEL2225_LENGTH          0x00000004

#define _GLCDCURDATA91_PIXEL2224_POSITION        0x0000001C
#define _GLCDCURDATA91_PIXEL2224_MASK            0xF0000000
#define _GLCDCURDATA91_PIXEL2224_LENGTH          0x00000004

#define _GLCDCURDATA92_PIXEL237_POSITION         0x00000000
#define _GLCDCURDATA92_PIXEL237_MASK             0x0000000F
#define _GLCDCURDATA92_PIXEL237_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL236_POSITION         0x00000004
#define _GLCDCURDATA92_PIXEL236_MASK             0x000000F0
#define _GLCDCURDATA92_PIXEL236_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL235_POSITION         0x00000008
#define _GLCDCURDATA92_PIXEL235_MASK             0x00000F00
#define _GLCDCURDATA92_PIXEL235_LENGTH           0x00000004

#define _GLCDCURDATA92_PIXEL234_POSITION         0x0000000C
#define _GLCDCURDATA92_PIXEL234_MASK             0x0000F000
#define _GLCDCURDATA92_PIXEL234_LENGTH           0x00000004

